using CityPharmacyChain.Domain;
using System.Security.Cryptography.X509Certificates;

namespace CityPharmacyChain.Tests;

public class PharmacyChainFixture
{
    public List<PriceListEntry> PriceList { get; set; }
    public List<Pharmacy> PharmacyList { get; set; }
    public List<Product> ProductList { get; set; }
    public List<PharmaceuticalGroup> PharmaceuticalGroups { get; set; }

    public PharmacyChainFixture()
    {
        PharmacyList =
        [
            new(1, "ВИТА", 89456372837, "г. Самара, ул. Ново-Садовая, д. 36", "Иванов Иван Иванович"),
            new(2, "Апрель", 86748356473, "г. Самара, пр-т. Ленина, д. 6", "Сергеев Геннадий Васильевич"),
            new(3, "БУДЬ ЗДОРОВ!", 87443856936, "г. Самара, пр-т. Ленина, д. 14", "Андреева Надежда Ивановна"),
            new(4, "Имплозия", 89975362563, "г. Самара, пр-т. Ленина, д. 6", "Петров Павел Сергеевич"),
        ];

        PriceList =
        [
            new(1, 146, 1, "АО Нижфарм", PaymentType.Cashless, DateTime.Parse("2024-08-01")),
            new(2, 190.8, 1, "АО Нижфарм", PaymentType.Cash, DateTime.Parse("2024-09-12")),
            new(3, 99, 2, "ООО Тульская Фармацевтическая Фабрика", PaymentType.Cashless, DateTime.Parse("2024-09-05")),
            new(4, 211, 2, "ЛТД Рекитт Бенкизер Хелскэр Интернешнл", PaymentType.Cashless, DateTime.Parse("2024-08-11")),
            new(5, 110, 1, "Фармстрандарт-Лексредства", PaymentType.Cash, DateTime.Parse("2024-07-24")),
            new(6, 150, 3, "ООО Лекарь", PaymentType.Cashless, DateTime.Parse("2024-09-01")),
            new(7, 139, 4, "ЗАО Лекко", PaymentType.Cash, DateTime.Parse("2024-09-03")),
            new(8, 382, 3, "ЗАО Лекко", PaymentType.Cash, DateTime.Parse("2024-08-30")),
            new(9, 144, 4, "Jelfa S A", PaymentType.Cash, DateTime.Parse("2024-08-30")),
        ];

        PharmaceuticalGroups =
        [
            new(1, "Антикоагулянт"),
            new(2, "Антибактериальное средство"),
            new(2, "Дезинфицирующее средство"),
            new(3, "Линимент"),
            new(4, "Нестероидное противовоспалительное средство"),
            new(5, "Сосудосуживающий препарат"),
            new(6, "Антибактериальное средство"),
            new(7, "Антибактериальное средство"),
            new(8, "Анальгезирующее средство"),
            new(8, "Нестероидное противовоспалительное средство"),
            new(8, "Психостимулирующее средство"),
            new(9, "Нестероидное противовоспалительное средство"),
        ];

        ProductList =
        [
            new(1, 1, 15, "Гепариновая мазь", "Мазь для наружного применения"),
            new(2, 1, 10, "Левомеколь", "Мазь для наружного применения"),
            new(3, 1, 20, "Линимент бальзамический (по Вишневскому)", "Мазь для наружного применения"),
            new(4, 1, 12, "Нурофен таблетки", "Таблетки, покрытые оболочкой"),
            new(5, 1, 5, "Риностоп спрей", "Спрей назальный"),
            new(6, 1, 8, "Стрептоцид порошок", "Порошок для наружного применения"),
            new(7, 1, 17, "Сульфацил-натрия капли глазные", "Капли глазные"),
            new(8, 1, 10, "Пенталгин Экстра гель", "Гель для наружного применения"),
            new(9, 1, 15, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой"),

            new(1, 2, 10, "Гепариновая мазь", "Мазь для наружного применения"),
            new(2, 2, 19, "Левомеколь", "Мазь для наружного применения"),
            new(4, 2, 5, "Нурофен таблетки", "Таблетки, покрытые оболочкой"),
            new(5, 2, 17, "Риностоп спрей", "Спрей назальный"),
            new(6, 2, 3, "Стрептоцид порошок", "Порошок для наружного применения"),
            new(8, 2, 2, "Пенталгин Экстра гель", "Гель для наружного применения"),
            new(9, 2, 12, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой"),

            new(2, 3, 10, "Гепариновая мазь", "Мазь для наружного применения"),
            new(5, 3, 4, "Риностоп спрей", "Спрей назальный"),
            new(6, 3, 7, "Стрептоцид порошок", "Порошок для наружного применения"),
            new(7, 3, 17, "Сульфацил-натрия капли глазные", "Капли глазные"),
            new(8, 3, 14, "Пенталгин Экстра гель", "Гель для наружного применения"),
            new(9, 3, 5, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой"),

            new(1, 4, 12, "Гепариновая мазь", "Мазь для наружного применения"),
            new(2, 4, 3, "Левомеколь", "Мазь для наружного применения"),
            new(3, 4, 20, "Линимент бальзамический (по Вишневскому)", "Мазь для наружного применения"),
            new(4, 4, 12, "Нурофен таблетки", "Таблетки, покрытые оболочкой"),
            new(5, 4, 16, "Риностоп спрей", "Спрей назальный"),
            new(6, 4, 10, "Стрептоцид порошок", "Порошок для наружного применения"),
            new(7, 4, 11, "Сульфацил-натрия капли глазные", "Капли глазные"),
        ];
    }
}
