using CityPharmacyChain.Domain;

namespace CityPharmacyChain.Tests;

public class PharmacyChainFixture
{
    public static List<PriceListEntry> CreatePharmacyList()
    {
        var priceList = new List<PriceListEntry>
        {
            new(1, 146, "STADA", "АО Нижфарм", PaymentType.Cashless, DateTime.Parse("2024-08-01")),
            new(2, 190.8, "STADA", "АО Нижфарм", PaymentType.Cash, DateTime.Parse("2024-09-12")),
            new(3, 99, "ООО Тульская Фармацевтическая Фабрика", "ООО Тульская Фармацевтическая Фабрика", PaymentType.Cashless, DateTime.Parse("2024-09-05")),
            new(4, 211, "Reckitt Benckiser", "ЛТД Рекитт Бенкизер Хелскэр Интернешнл", PaymentType.Cashless, DateTime.Parse("2024-08-11")),
            new(5, 110, "ОТИСИФАРМ", "Фармстрандарт-Лексредства", PaymentType.Cash, DateTime.Parse("2024-07-24")),
            new(6, 150, "ООО Лекарь", "ООО Лекарь", PaymentType.Cashless, DateTime.Parse("2024-09-01")),
            new(7, 139, "SOLOFARM", "ЗАО Лекко", PaymentType.Cash, DateTime.Parse("2024-09-03")),
            new(8, 382, "ОТИСИФАРМ", "ЗАО Лекко", PaymentType.Cash, DateTime.Parse("2024-08-30")),
            new(9, 144, "LANNACHER", "Jelfa S A", PaymentType.Cash, DateTime.Parse("2024-08-30")),
        };
        return priceList;
    }

    public static List<Pharmacy> CreatePharmacies()
    {
        var pharmacyList = new List<Pharmacy>
        {
            new(1, "ВИТА", 89456372837, "г. Самара, ул. Ново-Садовая, д. 36", "Иванов Иван Иванович"),
            new(2, "Апрель", 86748356473, "г. Самара, пр-т. Ленина, д. 6", "Сергеев Геннадий Васильевич"),
            new(3, "БУДЬ ЗДОРОВ!", 87443856936, "г. Самара, пр-т. Ленина, д. 14", "Андреева Надежда Ивановна"),
            new(4, "Имплозия", 89975362563, "г. Самара, пр-т. Ленина, д. 6", "Петров Павел Сергеевич"),
        };

        pharmacyList[0].Products =
        [
            new(1, 15, "Гепариновая мазь", "Мазь для наружного применения", ["Антикоагулянтное средство прямого действия для местного применения", "Прочие препараты"]),
            new(2, 10, "Левомеколь", "Мазь для наружного применения", ["Противомикробное средство комбинированное"]),
            new(3, 20, "Линимент бальзамический (по Вишневскому)", "Линимент", ["Антисептическое средство"]),
            new(4, 12, "Нурофен таблетки", "Таблетки, покрытые оболочкой", ["Нестероидный противовоспалительный препарат"]),
            new(5, 5, "Риностоп спрей", "Спрей назальный", ["Противоконгестивное средство", "Альфа-андреномиметик"]),
            new(6, 8, "Стрептоцид порошок", "Порошок для наружного применения", ["Противомикробное средство"]),
            new(7, 17, "Сульфацил-натрия капли глазные", "Капли глазные", ["Противомикробное средство"]),
            new(8, 10, "Пенталгин Экстра гель", "Гель для наружного применения", ["Нестероидное противовоспалительное средство для местного применения"]),
            new(9, 15, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой", ["Антиагрегантное средство"]),
        ];
        pharmacyList[1].Products =
        [
            new(1, 10, "Гепариновая мазь", "Мазь для наружного применения", ["Антикоагулянтное средство прямого действия для местного применения", "Прочие препараты"]),
            new(2, 19, "Левомеколь", "Мазь для наружного применения", ["Противомикробное средство комбинированное"]),
            new(4, 5, "Нурофен таблетки", "Таблетки, покрытые оболочкой", ["Нестероидный противовоспалительный препарат"]),
            new(5, 17, "Риностоп спрей", "Спрей назальный", ["Противоконгестивное средство", "Альфа-андреномиметик"]),
            new(6, 3, "Стрептоцид порошок", "Порошок для наружного применения", ["Противомикробное средство"]),
            new(8, 2, "Пенталгин Экстра гель", "Гель для наружного применения", ["Нестероидное противовоспалительное средство для местного применения"]),
            new(9, 12, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой", ["Антиагрегантное средство"]),
        ];
        pharmacyList[2].Products =
        [
            new(1, 10, "Гепариновая мазь", "Мазь для наружного применения", ["Антикоагулянтное средство прямого действия для местного применения", "Прочие препараты"]),
            new(5, 4, "Риностоп спрей", "Спрей назальный", ["Противоконгестивное средство", "Альфа-андреномиметик"]),
            new(6, 7, "Стрептоцид порошок", "Порошок для наружного применения", ["Противомикробное средство"]),
            new(7, 17, "Сульфацил-натрия капли глазные", "Капли глазные", ["Противомикробное средство"]),
            new(8, 14, "Пенталгин Экстра гель", "Гель для наружного применения", ["Нестероидное противовоспалительное средство для местного применения"]),
            new(9, 5, "Тромбо АСС таблетки", "Таблетки, покрытые оболочкой", ["Антиагрегантное средство"]),
        ];
        pharmacyList[3].Products =
        [
            new(1, 12, "Гепариновая мазь", "Мазь для наружного применения", ["Антикоагулянтное средство прямого действия для местного применения", "Прочие препараты"]),
            new(2, 3, "Левомеколь", "Мазь для наружного применения", ["Противомикробное средство комбинированное"]),
            new(3, 20, "Линимент бальзамический (по Вишневскому)", "Линимент", ["Антисептическое средство"]),
            new(4, 12, "Нурофен таблетки", "Таблетки, покрытые оболочкой", ["Нестероидный противовоспалительный препарат"]),
            new(5, 16, "Риностоп спрей", "Спрей назальный", ["Противоконгестивное средство", "Альфа-андреномиметик"]),
            new(6, 10, "Стрептоцид порошок", "Порошок для наружного применения", ["Противомикробное средство"]),
            new(7, 11, "Сульфацил-натрия капли глазные", "Капли глазные", ["Противомикробное средство"]),
        ];
        return pharmacyList;
    }
}
